lib/tasks/fae_tasks.rake

DELETE FROM "fae_roles"
INSERT INTO "fae_roles" ("name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "super admin"], ["position", 1], ["created_at", "2019-08-02 15:02:24.562396"], ["updated_at", "2019-08-02 15:02:24.562396"]]
INSERT INTO "fae_roles" ("name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "admin"], ["position", 1], ["created_at", "2019-08-02 15:02:24.574229"], ["updated_at", "2019-08-02 15:02:24.574229"]]
INSERT INTO "fae_roles" ("name", "position", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "user"], ["position", 2], ["created_at", "2019-08-02 15:02:24.579057"], ["updated_at", "2019-08-02 15:02:24.579057"]]
SELECT  "fae_options".* FROM "fae_options" ORDER BY "fae_options"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "fae_options" ("title", "time_zone", "live_url", "singleton_guard", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  task :seed_db => :environment do
    Fae::Role.delete_all
    Fae::Role.create(name: 'super admin', position: 0)
    Fae::Role.create(name: 'admin', position: 1)
    Fae::Role.create(name: 'user', position: 2)

    if Fae::Option.first.blank?
      option = Fae::Option.new({
        title: 'Bucks Adoption',
        singleton_guard: 0,
        time_zone: 'GMT',
        live_url: 'https://www.buckinghamshire.gov.uk/care-children-and-families/adoption/'
        })
      option.save!